package com.cys.day07;

public class Test3 {
    public static void main(String[] args) {
        /*
         * 1.	举例说明类与对象的关系，并用一句话总结(没有标准答案，重在理解)。
         * 对象是类的实例化
         * 2.	写一个类由那几个部分组成，以及每一个部分是干什么用的？
         * 类名，修饰词，成员变量，成员方法，构造器方法，继承，接口
         * 类名是标识类，用于程序引用该类
         * 修饰词用于修饰成员变量和成员方法，私有或者公共使用
         * 成员变量是封装对象的属性
         * 成员方法是暴露成员变量，或者构建对象行为
         * 构造器方法包括无参数构造器和有参数构造器，是用于对象的初始化
         * 继承是实现代码的重用，一个子类只能继承一个父类
         * 接口是对类的实现，展现了类的多态性，一个类可以继承多个接口
         * 3.	写出创建对象的格式，并用注释写上创建对象和构造方法的关系
         * 类名 对象名 = new 构造器();
         * 有参数构造器，可以在创建对象的时候给对象赋值，无参数构造器可以之后为对象赋值
         * 4.	被private修饰的变量局部什么特点？
         * 可以被本类直接调用，实现私有化，封装数据，更加安全
         * 5.	被private修饰的变量，如果想要在外部类中被访问，需要怎么办？
         * 用set/get方法暴露出去
         */
    }
}
